In [2]:
import pandas as pd
import numpy as np

stuff = {
    "Corporation": ["Apple", "Google", "Meta", "Apple", "Google", "Meta"],
    "Employees": ["John", "April", "Wes", "Beth", "Justin", "Steph"],
    "Salary": [200, 220, 190, 130, 120, 150],
}
my_table = pd.DataFrame(stuff)
my_table

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [5]:
# Sorting from lowest to highest | Ascending, Inplace
my_table.sort_values("Salary", ascending=False, inplace=True)

In [10]:
# Sorting from lowest to highest alphabetically | Ascending, Inplace
my_table.sort_values("Corporation", ascending=True, inplace=True)
my_table

  Corporation Employees  Salary
3       Apple      Beth     130
0       Apple      John     200
1      Google     April     220
4      Google    Justin     120
5        Meta     Steph     150
2        Meta       Wes     190